//*****************************************************************************
//
//! kal_printf.h 格式化打印 接口文件
//!
//! @author  CVZTS
//! @date    2025-07-05
//! @version V100R001SP0001
//!
//! update:
//! Date           Author       Notes
//! 2025-07-05     cvzts        the first version for format print 
//
//*****************************************************************************

#ifndef __KAL_PRINTF_H__
#define __KAL_PRINTF_H__

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ================================== API ====================================
 */

//*****************************************************************************
//
//! \brief 格式化打印
//!
//! \param [in] fmt 格式化字符串
//! \param [in] ... 参数表
//!
//! \retval - \b 已打印字符数
//
//*****************************************************************************
extern int32_t kal_printf(const char *fmt, ...);

/*
 *  ================================== 结束 ===================================
 */

#ifdef __cplusplus
}
#endif

#endif // __KAL_PRINTF_H__
